{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "age"}, "name": "age", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "ca"}, "name": "ca", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "chol"}, "name": "chol", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "cp"}, "name": "cp", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "oldpeak"}, "name": "oldpeak", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "sex"}, "name": "sex", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "slope"}, "name": "slope", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "thal"}, "name": "thal", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "thalach"}, "name": "thalach", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "trestbps"}, "name": "trestbps", "inbound_nodes": []}, {"class_name": "DenseFeatures", "config": {"name": "feature", "trainable": true, "dtype": "float32", "feature_columns": [{"class_name": "NumericColumn", "config": {"key": "age", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "BucketizedColumn", "config": {"source_column": {"class_name": "NumericColumn", "config": {"key": "age", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, "boundaries": [18, 25, 30, 35, 40, 45, 50, 55, 60, 65]}}, {"class_name": "NumericColumn", "config": {"key": "ca", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "chol", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "cp", "vocabulary_list": ["0", "1", "2", "3"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "NumericColumn", "config": {"key": "oldpeak", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "sex", "vocabulary_list": ["0", "1"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "slope", "vocabulary_list": ["0", "1", "2"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "thal", "vocabulary_list": ["fixed", "normal", "reversible"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "NumericColumn", "config": {"key": "thalach", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "trestbps", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}]}, "name": "feature", "inbound_nodes": [{"age": ["age", 0, 0, {}], "trestbps": ["trestbps", 0, 0, {}], "chol": ["chol", 0, 0, {}], "thalach": ["thalach", 0, 0, {}], "oldpeak": ["oldpeak", 0, 0, {}], "ca": ["ca", 0, 0, {}], "thal": ["thal", 0, 0, {}], "sex": ["sex", 0, 0, {}], "cp": ["cp", 0, 0, {}], "slope": ["slope", 0, 0, {}]}]}, {"class_name": "Dense", "config": {"name": "hidden_layer_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_layer_1", "inbound_nodes": [[["feature", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["hidden_layer_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidden_layer_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidden_layer_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "target", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "target", "inbound_nodes": [[["hidden_layer_2", 0, 0, {}]]]}], "input_layers": [["age", 0, 0], ["trestbps", 0, 0], ["chol", 0, 0], ["thalach", 0, 0], ["oldpeak", 0, 0], ["ca", 0, 0], ["thal", 0, 0], ["sex", 0, 0], ["cp", 0, 0], ["slope", 0, 0]], "output_layers": [["target", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "hidden_layer_1/kernel", "shape": [29, 128], "dtype": "float32"}, {"name": "hidden_layer_1/bias", "shape": [128], "dtype": "float32"}, {"name": "hidden_layer_2/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "hidden_layer_2/bias", "shape": [128], "dtype": "float32"}, {"name": "target/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "target/bias", "shape": [1], "dtype": "float32"}]}]}